/* 1: 用户协议 2: 购买须知 3:概率 */
export const modalContent = (index: number) => {
  switch (index) {
    case 1:
      return '卡核服务协议提示条款<br> 欢迎您与卡核经营者(详见定义条款)共同签署本《卡核服务协议》(下称“本协议”")并使用卡核服务!各服务条款前所列索引关键词仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。 「审慎阅读」您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制麦任的条款、法律适用和争议解决条款。免除或者限制责任的条款将以粗体下划线标识，您应重点阅读。如您对协议有任何疑问，可向卡核客服咨询。<br> 「签约动作」当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与卡核经营者达成—致，成为卡核“用户”。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。<br> —、定义<br> 卡核服务协议<br> 卡核:指卡核微信小程序(名称为卡核丨手办模玩一番赏)。卡核经营者:指经营卡核的各法律主体。卡核经营者可能根据卡核的业务调整而发生变更，目前为佛山市顺德区卡核贸易商行。<br> 卡核服务:卡核基于互联网，以包含卡核微信小程序等在内的各种形态(包括未来技术发展出现的新的服务形态)向您提供的各项服务。<br> 卡核规则:包括在所有卡核规则，频道内已经发布及后续发布的全部规则、解读、公告等内容以及卡核经营者在网站、圈子、论坛、个人中心内发布的各类规则、实施细则、产品流程说明、公告等。<br> 关联公司:除卡核经营者外的单称。<br> 同—用户:使用同—身份认证信息或经卡核经营者排查认定多个卡核账户的实际控制人为同—人的，均视为同—用户。<br> 二、协议范围2.1签约主体<br> 「平等主体」本协议由您与卡核经营者共同缔结，本协议对您与卡核经营者均具有合同效力。<br> 「主体信息」卡核经营者是指经营卡核的各法律主体。本协议项下，卡核经营者可能根据卡核的业务调整而发生变更，变更后的卡核经营者与您共同履行本协议并向您提供服务，卡核经营者的变更不会影响您本协议项下的权益。卡核经营者还有可能因为提供新的卡核服务而新增。如您使用新增的卡核服务的，视为您同意新增的经营者与您共同履行本协议。发生争议时，您可根据您具体使用的服务及对您权益产生影响的具体行为对象确定与您履约的主体及争议相对方。<br> 2.2补充协议<br> 由于互联网高速发展，您与卡核签署的本协议列明的条款并不能完整罗列并覆盖您与卡核所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此,卡核未来新增的协议等均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如有新增协议，卡核将对您进行告知，如您使用卡核服务，视为您同意上述补充协议。<br> 三、账户注册与使用<br> 1用户资格<br> 您确认，在您开始注册程序使用卡核服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的—切后果。<br> 此外，您还需确保您不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象，否则您可能无法正常注册及使用卡核的服务。<br> 3.2账户说明<br> 「账户获得」目前卡核使用微信提供的第三方平台账户登陆，您根据登陆时的相关提示填写必要信息后，您将获得卡核账户。卡核只允许每位用户使用—个卡核账户。如有证据证明或卡核经营者根据各类数据规则判断您存在不当注册或不当使用多个卡核账户的情形，卡核经营者可采取冻结或关闭账户、取消订单、拒绝提供服务等措施，如给卡核及相关方造成损失的，您还应承担赔偿责任。<br> 「账户使用」由于您的卡核账户关联您的个人信息及卡核商业信息，您的账户仅限您本人使用。未经卡核同意，您直接或间接授权第三方使用您卡核账户或获取您账户项下信息的行为无效。如卡核经营者根据卡核规则中约定的违约认定程序及标准判断您卡核账户的使用可能危及您的账户安全及/或卡核信息安全的，卡核经营者可拒绝提供相应服务或终止本协议。<br> 「账户转让」由于用户账户关联用户信用信息，仅当有法律明文规定、司法裁定或经卡核经营者同意，并符合卡核规则规定的用户账户转让流程的情况下，您可进行账户的转让。您的账户—经转让，该账户项下权利义务—并转移。除此外，您的账户不得以任何方式转让，否则卡核经营者有权追究您的违约责任，且由此产生的—切责任均由您承担。<br> 「实名认证」作为卡核经营者，为使您更好地使用卡核的各项服务，保障您的账户安全，卡核有权要求您按照我国法律规定完成实名认证。<br> 3.3注册信息管理<br> 3.3.1真实合法<br> 「信息真实」在使用卡核服务时，您应当按卡核页面的提示准确完整地提供您的信息（包括您的姓名及联系电话、联系地址等)，以便卡核或其他用户与您联系。您了解并同意，您有义务保持您提供信息的真实性及有效性。<br> 3.3.2更新维护<br> 您应当及时更新您提供的信息，在法律有明确规定要求卡核作为服务提供者必须对部分用户(如卖家等)的信息进行核实的情况下，卡核将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整、有效的信息。如卡核按您最后—次提供的信息与您联系未果、您未按卡核的要求及时提供信息、您提供的信息存在明显不实或行政司法机关核实您提供的信息无效的，您将承担因此对您自身、他人及卡核造成的全部损失与不利后果。卡核运营团队可向您发出询问要求整改的通知，并要求您进行重新认证，直至中止、终止对您提供部分或全部卡核服务，卡核对此不承担责任。<br> 3.4账户安全规范<br> 「账户安全保管义务」由于卡核目前采用微信平台账户登录，您的账户为您自行设置并由您保管，建议您务必保管好您的账户，账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果,卡核并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。 「账户行为责任自负」除卡核存在过错外，您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、购买商品及服务及披露信息等)负责。<br> 「日常维护须知」如发现任何未经授权使用您账户登录卡核其他可能导致您账户遭窃、遗失的情况，建议您立即通知卡核。您理解卡核对您的任何请求采取行动均需要合理时间，且卡核应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除卡核存在法定过错外，卡核不承担责任。<br> 四、卡核服务及规范<br> 「服务概况」您有权在卡核上享受商品购买、消费等服务。卡核提供的服务内容众多，具体您可登录卡核浏览。<br> 4.1商品及/或服务的购买<br> 「商品及/或服务的购买」当您在卡核购买商品及/服务时，请您务必仔细确认所购商品的品名、价格、数量、型号、规格、尺寸或服务的时间、内容、限制性要求等重要事项，并在下单时核实您的联系地址、电话、收货人等信息。如您填写的收货人非您本人，则该收货人的行为和意思表示产生的法律后果均由您承担。您的购买行为应当基于真实的消费需求，不得存在对商品及服务实施恶意购买、恶意维权等。扰乱卡核正常交易秩序的行为。基于维护卡核交易秩序及交易安全的需要，卡核发现上述情形时可主动执行关闭相关交易订单等操作。<br> 4.2交易争议处理<br> 「交易争议处理途径」您在卡核交易过程中发生争议的，您有权选择以下途径解决:<br> (一）与争议相对方自主协商<br> (二)请求消费者协会或者其他依法成立的调解组织调解;(三)向有关行政部门投诉;<br> (四)根据与争议相对方达成的仲裁协议(如有)提请仲裁机构仲裁;<br> (五)向人民法院提起诉讼。<br> 4.3费用<br> 运营团队为卡核向您提供的服务付出了大量的成本，除卡核明示的收费业务外，卡核向您提供的服务目前是免费的。如卡核向您收取合理费用，卡核会为合理途径并以足够合理的期限提前通过法定程序并以本协议第八条约定的方式通知您，确保您有充分选择的权利。<br> 4.4卡核规则<br> 由于卡核提供的服务众多，不同的服务其表现形式，操作流程与规范可能存在巨大差异，针对不同类型的服务，卡核将提供不同的规则用于说明、解释服务的使用方法与规范，您需同意不同类型服务所对应的规则才可以使用该服务，如您不同意该规则，则视为放弃该服务所属所有功能与其他服务中含有的与该服务关联的功能，您可能因此无法使用其他服务的部分或全部功能。如您使用该服务，则视为您同意该服务的所有规则。<br> 4.5责任限制<br> 「不可抗力及第三方原因」卡核依照法律规定履行基础保障义务，但对于下述原因导致的合同履行障碍、履行瑕疵、履行延后或履行内容变更等情形，卡核并不承担相应的违约责任:<br> (一)因自然灾害、罢工、暴乱、战争、政府行为、司法行政命令等不可抗力因素;<br> (二)因电力供应故障、通讯网络故障等公共服务因素或第三人因素;<br> (三)在卡核已尽善意管理的情况下，因常规或紧急的设备与系统维护、设备与系统故障、网络信息与数据安全等因素。五、用户信息的保护及授权<br> 5.1个人信息的保护<br> 卡核非常重视用户个人信息(即能够独立或与其他信息结合后识别用户身份的信息)的保护，在您使用卡核提供的服务时，您同意卡核经营者按照在卡核上公布的隐私权政策在符合微信平台相关协议的基础上收集、存储、使用、披露和保护您的个人信息。 5.2非个人信息的保证与授权<br> 「信息的发布」您声明并保证，您对您所发布的信息拥有相应、合法的权利。否则，卡核可对您发布的信息依法或依本协议进行删除或屏蔽。<br> 「禁止性信息」您应当确保您所发布的信息不包含以下内容:(—)违反国家法律法规禁止性规定的;<br> (二)政治宣传、圭寸建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的;<br> (三)欺诈、虚假、不准确存在误导性的;<br> (四)侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的;<br> (五)侮辱、诽谤、恐吓、涉及他人隐私等侵害他人合法权益的;<br> (六)存在可能跛坏、篡改、删除、影响卡核任何系统正常运行或未经授权秘密获取卡核及其他用尸的数据、个人资料的病霉、木马、爬虫等恶意软件、程序代码的;<br> (七)其他违背社会公共利益或公共道德或依据相关卡核抽盒视协议、规则的规定不适合在卡核上发布的。<br> 六、用户的违约及处理<br> 发生如下情形之—的，视为您违约:<br> (一）使用卡核服务时违反有关法律法规规定的;<br> (二)违反本协议或本协议补充协议(即本协议第2.2条)约定的。<br> 为满足海量用户对高效优质服务的需求，您理解并同意，卡核可在卡核规则中约定违约认定的程序和标准。如:卡核可依据您的用户数据与海量用户数据的关系来认定您是否构成违约;您有义务对您的数据异常现象进行充分举证和台理解释，否则将被认定为违约。 6.2违约处理措施<br> 「信息处理」您在卡核上发布的信息构成违约的，卡核可根据相应规则立即对相应信息进行删除、屏蔽处理或对您的商品进行下架 「行为限制」您在卡核上实施的行为，或虽未在卡核上实施但对卡核及其用户产生影响的行为构成违约的，卡核经营者可依据相应规则对您执行账户扣分、限制功能使用权限、中止向您提供部分或全部服务等处理措施。如您的行为构成根本违约的，卡核可查封您的账户，终止向您提供服务。<br> 「卡核支付账户处理」当您违约的同时存在欺诈、售假、盗用他人账户等特定情形或您存在危及他人交易安全账户安全风险时，运营团队会依照您行为的风险程度对您的卡核为账户采取取消收款、资金止付等强制措施。<br> 「处理结果公示」卡核可将对您上述违约行为处理措施信息以及其他经国家行政或司法机关生效法律文书确认的违法信息在卡核上予以公示。<br> 6.3赔偿责任<br> 如您的行为使卡核及/或关联公司遭受损失(包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失)，您应赔偿卡核及/或其关联公司的上述全部损失。如您的行为使卡核及/或其关联公司遭受第三人主张权利，卡核及/或其关联公司可在对第三人承担金钱绐付等义务后就全部损失向您追偿。<br> 6.4特别约定<br> 「关联处理」如您因严重违约导致卡核终止本协议时，出于维护秩序及保护消费者权益的目的，卡核及/或其关联公司可对与您在其他协议项下的合作采取中止甚或终止协议的措施，并以本协议第八条约定的方式通知您。<br> 如卡核与您签署的其他协议及卡核及/或其关联公司与您签署的协议中明确约定了对您在本协议页下台作进行关联处理的情形，则卡核出于维护秩序及保护消费者权益的目的，可在收到指令时中止甚至终止协议，并以本协议第八条约定的方式通知您。 七、协议的变更<br> 卡核可根据国家法律法规变化及维护交易秩序、保护消费者权益需要，不时修改本协议、补充协议，变更后的协议、补充协议(下称“变更事项")将通过法定程序并以本协议第八条约定的方式通知您。<br> 如您不同意变更事项，您有权于变更事项确定的生效日前联系卡核反馈意见。如反馈意见得以采纳，卡核将酌情调整变更事项。如您对已生效的变更事项仍不同意的，您应当于变更事项确定的生效之日起停止使用卡核服务，变更事项对您不产生效力;如您在变更事项生效后仍继续使卡核服务则视为您同意已生效的变更事项。<br> 八、通知<br> 8.1有效联系方式<br> 您在注册成为卡核用户，并接受卡核提供的服务时，您应该向卡核提供真实有效的联系方式(包括您的联系电话、联系地址等)，对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。<br> 您在注册卡核用户时生成的用于登陆卡核接收系统消息和即时信息的会员账号（包括子账号)，也作为您的有效联系方式。卡核将向您的上述联系方式的其中之一或其中若干向您送达各类通知，无法接收通知可能对您的权利义务产生重大的有利不利影响，请您务必及时关注。<br> 8.2通知的送达<br> 卡核通过上述联系方式向您发出通知，包括但不限于在卡核公告，向您提供的联系电话发送手机短信，向您的账号发送信息、系统消息以及站内信信息，在发送成功后即视为送达。<br> 对于在卡核上因交易活动引起的任何纠纷，您同意司法机关（包括但不限于人民法院)可以通过手机短信、即时通讯工具等现代通讯方式或邮寄方式向您送达法律文书(包括但不限于诉讼文书)。您指定接收法律文书的手机号码或卡核账号等联系方式为您在卡核注册、更新时提供的手机号码以及在注册用户时卡核生成的账号，司法机关向上述联系方式发出法律文书即视为送达。您指定的邮寄地址为您的法定联系地址或您提供的有效联系地址。<br> 您同意司法机关可采取以上—种或多种送达方式向您送达法律文书，司法机关采取多种方式向您送达法律文书，送达时间以上述送达方式中最先送达的为准。<br> 您同意上述送达方式适用于各个司法程序阶段。如进入诉讼程序的，包括但不限于—审、二审、再审、执行以及督促程序等。你应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，由您自行承担由此可能产生的法律后果。<br> 九、协议的终止9.1终止的情形<br> 「用户发起的终止」您有权通过以下任—方式终止本协议:<br> (一)变更事项生效前您停止使用并明示不愿接受变更事项<br> (二)您明示不愿继续使用卡核服务，且符合服务终止条件的。<br> 「卡核发起的终止」出现以下情况时，卡核可以本协议第八条的所列的方式通知您终止本协议:<br> (一)您违反本协议约定，卡核依据违约条款终止本协议的;<br> (二)您盗他人账户、发布违禁信息、骗取他人财物、售假、扰乱市场秩序、采取不正当手段谋利等行为，卡核依据卡核规则对您的账予以查封的;<br> (三)除上述情形外，因您多次违反卡核规则相关规定且情节严重，卡核依据卡核规则对您的账户予以查封的;<br> (四)您的账户被卡核依据本协议回收的;<br> 五)您在卡核关联产品、发布或销售假冒伪劣!侵权商品、侵犯他人合法权益或其他严重违法违约行为的;<br> (六)其它应当终止服务的情况。<br> 9.2协议终止后的处理<br> 「用户信息披露」本协议终止后，除法律有明确规定外，卡核无义务向您或您指定的第三方披露您账户中的任何信息。_「卡核权利」本协议终止后，卡核经营者仍享有下列权利:<br> (一）继续保存您留存于卡核的本协议第五条所列的各类信息;<br> (二)对于您过往的违约行为，卡核仍可依据本协议向您追究违约责任。<br> 「交易处理」本协议终止后，对于您在本协议存续期间产生的交易订单，卡核可通知交易相对方并根据交易相对方的意愿决定是否关闭该等交易订单;如交易相对方要求继续履行的，则您应当就该等交易订单继续履行本协议及交易订单的约定，并承担因此产生的任何损失或增加的任何费用。<br> 十、法律适用、管辖与其他<br> 「法律适用」本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律;如法律无相关规定的，参照商业惯例及/或行业惯例。「管辖」您因使用卡核服务所产生及与卡核服务有关的争议，由卡核与您协商解决。协商不成时，任何—方均可向被告所在地的有管辖权的人民法院提起诉讼。<br> 「可分性」本协议任—条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。';
    case 2:
      return `
亲爱的顾客，您好！在购买前，请认真阅读并知悉《购买须知》后进行购买哦！

一、一番赏赏池、赏箱、赏品、盒柜的定义
1.1 单个IP主题的一番赏构成一个赏池，每个赏池包含若干个赏箱，赏箱内可能包含 “最终赏”以及SAR/UR/SSR/SR/R等不同等级的赏品，赏品等级只是对赏等级的命名方式，赏品均有配图及介绍。赏箱页面内实时更新各等级赏品余量情况，供顾客参考。开赏后的赏品会放入盒柜，顾客需要填写地址发货。

二、无限赏、赏箱、赏品、盒柜的定义
2.1 盲盒商品请谨慎例行购买，未成年人禁止下单。
2.2 根据您的需求点击买N个赏品，不存在空盒，100%有赏品，赏品类型以及获得概率以赏品页面显示为准。
2.3 所有赏品概率及记录均在赏品详情展示，请参考后下单，平台保证公平公正公开的原则。

三、赏品的获取
5.1开赏得到相应等级赏品后，赏品将会放入盒柜等待用户下单发货
5.2 “终赏”是最后一个购买商品的用户(以系统记录的操作时间为准)赠送。
5.3 本平台提倡谨慎判断、理性消费的原则

三、其他提示
6.1 如果您在使用过程中遇到问题，请在“我的”页面点击"联系客服”按钮，根据提示联系客服咨询问题。
6.2 本规则严格遭照本平台官方规则制定

四、发货规则
7.1 开赏后的赏品会放进盒柜，您可以到“盒柜”内手动申请发货。
7.2请务必确保您填写的默认地址是真实有效的，因您地址错误或其他个人原因导致的任何损失由您自行承担。
7.3 我们会根据申请发货的先后顺序安排发货，如遇节假日或特殊情况会暂停或延缓发货，但我们会竭尽全力将现货商品尽快送达您的手中。
7.4 发货机制:本平台默认使用顺丰速运，1件起即可发货，无发货门槛，运费 12元/单，申请发货后1至7个工作日内发出，如遇法定节假日可能会延迟1~5天。
7.5 如因非人为原因导致出现赏品损坏请及时沟通客服(请录制好开箱视频)，可调换新的同款赏品(以退换货规则为准)。
7.6 为保障每一个用户能够公平享有冲赏的权利，我们会对用户的冲赏行为进行实时监测，对于出现恶意行为的用户，我们有权要求其退还因恶意行为获得的额外利益并进行警告，出现两次恶意行为，用户将被拉入黑名单，并冻结平台账户，不可使用一番赏购买服务及其他相关服务。
7.7 恶意行为:开箱后无质量问题以各种理由要求退款、欺骗或与他人联合欺骗其他冲赏用户、利用系统BUG恶意冲赏等。
7.8 一番赏内赏品难免存在轻微蹭色、溢色等轻微瑕疵，不支持因此提出的退换货申请，请您知悉并谨慎考虑后购买。
7.9 如您收到的商品有质量问题，如:存在损坏、少件或遗失，请您提供有效凭证，证明签收时商品即存在上述问题，平台将提供退换货服务且由平台承担来回运费。

八、关于商品缺货的处理
8.1 由于市场变化、系统问题、不可抗力等因素影响，您所提交的订单信息中的商品可能出现缺货情形。在此情形下，我方将以有效方式(包括但不限于向您提供的联系电话发送手机短信)通知您并提供解决方案(包括但不限于取消订单、换货、调货等方式)。请您在未收到商品之前留意通知，若我方自发出通知一周内超过两次无法与您取得电话联系且您在收到我方通知超过30天未主动联系在线客服，将有权取消订单并退还您所支付的冲赏费用，由此给您带来的不便敬请谅解。缺货商品是否补货不再另行通知，如您对此商品感兴趣，请您随时关注。

九、关于售后
9.1 一番赏内商品由于属于IP定制产品难免存在轻微蹭色、溢色等涂装问题的瑕疵，此类品牌方官瑕不属于质量问题，我们保证相应产品已获得版权方授权，为正版商品。我们不接受因上述瑕疵问题因此提出的退换货申请，请您知悉并谨慎考虑后购买。
9.2如您收到的商品有质量问题，如:存在损坏、少件或遗失，请您提供有效凭证，证明签收时商品即存在上述问题，平台将提供退换货服务且由平台承担来回运费。
9.3接受售后时间:退货申请--自物流签收后起7天内;换货申请--自物流签收后起15天内(以自然天计算)。
9.4售后处理时效:如需回寄退换货的，用户需在收到我方通知起7天内回寄商品(春节假期以平台内公告为准)。
9.5品牌方售后处理周期以品牌方时效为准。

十、关于平台所使用的无门槛券、积分等可在本平台兑换商品时用于抵扣，具体可使用的商品和抵扣的金额以订单确认页的信息为准，无法转让、兑现、交易，如有联系交易积分/无门槛券等信息，请勿上当受骗，若因个人原因所造成损失，本平台概不负责。

`;
    case 3:
      return "尊敬的顾客，您好！<br>凡购买卡核一番赏特制明信片，均可获赠精美礼品。<br>对于各项礼品的获得率、获得记录，都会在购买页面公示，请理性消费";
    case 4:
      return `
1.发货机制:一件可发，无发货门槛仅需支付12元邮费。<br>
2.请务必确保您填写的默认地址是真实有效的，因您地址错误或其它个人原因导致的任何损失由您自行承担。<br>
3.我们会根据申请发货的先后顺序1~7个工作日之内安排发货，如遇节假日或特殊情况会暂停或延缓1~5天发货，但我们会竭尽全力将现货商品尽快送达您的手中。<br>
4.收货前建议录制开箱视频，如遇商品运损或其它问题，请提供开箱视频联系在线客服处理。<br>
5.卡牌类产品对卡牌品相、评级评分有不同需求，发货前请确认卡牌品相，在购买界面会展示卡牌的品相以及卡牌品相定义。<br>
 `;
    case 5:
      return `1、消费会按照1: 1的比例获得经验。<br>
                2、累计达到相应经验后可升级。<br>
                    3、首次升级可获得首升奖励（具体获得内容请查看奖励详情）。<br>
                        4、每日登录会获得相应的vip礼包（具体内容请查看奖励详情）。<br>
                            5、升级到相应vip等级会获得相应等级标识及头像框展示。<br>
                                6、目前处于试运营阶段，奖励可能会根据运营策略进行调整。<br>
                                    7、有任何疑问可咨询客服。`;
    case 6:
      return `
            无限赏规则与说明

一、玩法说明:

1.1 明信片为开赏类盲盒商品，一经购买不接受无理由退款，请谨慎例行购买(未成年人禁止下单)

1.2根据您的需求点击买N张，获得N张明信片，同时会获得对应张数的赠送赏品，100%有赠品，赏品类型以及获得概率已商品详情为准。

1.3所有赏品概率及记录均在赏品详情展示，请参考后下单，平台保证公平公正公开的原则。

1.4 赏品按稀有度分别为SP赏、A赏、B赏，C赏、D赏等等级，每个品级获得概率以公示为准。

二、特殊模式说明

1.保底模式幸运值说明，如果开启了幸运池，则每当幸运值满后都会 必出一个限定等级的商品，具体等级已商品详情为准，幸运值所需数量请对应幸运值展示界面，能量为单套累计，多套一起购买不叠加在一起，分开计算。

2.\t如果开启了魔王奖励，则获得带有魔王凭证的赏品的魔王将会成为当前魔王，之后购买的金额将会按商品详情点击魔王奖励公示的比例奖励给欧王，直到下一个获得带有魔王凭证的赏品的魔王出现为止。
三、关于发货

1、开赏后的赏品会放进盒柜，您可以到“盒柜”内手动申请发货。

2、请务必确保您填写的默认地址是真实有效的，因您地址错误或其他个人原因导致的任何损失由您自行承担。

3、我们会根据申请发货的先后顺序安排发货，如遇节假日或特殊情况会暂停或延缓发货，但我们会竭尽全力将现货商品尽快送达您的手中，申请发货后7-10个工作日内发出。

4、发货机制:平台默认使用中通物流，一件起发，满5件国内包邮(新疆、内蒙、港澳台除外)，小于5件需支付10元邮费。

5、如因非人为原因导致出现赏品损坏请及时沟通客服(请按照封箱贴上的提示，录制好开箱视频)，可调换新的同款赏品(以退换货规则为准);不支持退货、调换其他款赏品。

6、为保障每一个用户能够公平享有冲赏的权利，我们会对用户的冲赏行为进行实时监测，对于出现恶意行为的用户，我们有权要求其退还因恶意行为获得的额外利益并进行警告;出现两次恶意行为，用户将被拉入黑名单，并冻结其卡核一番赏账户，不可使用一番赏购买服务及其他相关服务。

恶意行为:开箱后无质量问题以各种理由要求退款、欺骗或与他人联合欺骗其他冲赏用户、利用系统BUG恶意冲赏等。

7、无限赏内赏品难免存在轻微蹭色、溢色等轻微瑕疵，不支持因此提出的退换货申请，请您知悉并谨慎考虑后购买;
8、如您收到的商品有质量问题，如:存在损坏、少件或遗失,请您提供有效凭证，证明签收时商品即存在上述问题，平台将提供退换货服务且由平台承担来回运费。

四、关于商品缺货的处理

由于市场变化、系统问题、不可抗力等因素影响，您所提交的订单信息中的商品可能出现缺货情形。在此情形下，卡核一番赏将以有效方式(包括但不限于向您提供的联系电话发送手机短信)通知您并提供解决方案(包括但不限于取消订单、换货、调货等方式)。请您在未收到商品之前留意通知，若卡核一番赏自发出通知一周内超过两次无法与您取得电话联系且您在收到卡核一番赏通知超过30天未主动联系在线客服，将有权取消订单并退还您所支付的冲赏费用，由此给您带来的不便敬请谅解。缺货商品是否补货不再另行通知，如您对此商品感兴趣，请您随时关注。

五、关于售后

1、因盲盒商品特殊性不支持7天无理由退换货;

2、无限赏内商品由于属于IP定制产品难免存在轻微蹭色、溢色等涂装问题的瑕疵，此类问题不属于质量问题，我们保证相应产品已获得版权方授权，为正版商品。我们不接受因上述瑕疵问题因此提出的退换货申请，请您知悉并谨慎考虑后购买;

3、如您收到的商品有质量问题，如:存在损坏、少件或遗失,请您提供有效凭证，证明签收时商品即存在上述问题，平台将提供退换货服务且由平台承担来回运费。

4、接受售后时间:退货申请--自物流签收后起7天内;换货申请--自物流签收后起15天内(以自然天计算)

5、售后处理时效:如需回寄退换货的，用户需在收到卡核一番赏通知起7天内回寄商品(春节假期以卡核一番赏公告为准)。

6、品牌方售后处理周期以品牌方时效为准。

            `;
    case 7:
      return `针对未成年人相关问题申诉请通过小程序客服申
诉，井需要提交以下材料:用户账户信息、用户姓
名、身份证号、身份证正反面、户口本，孩子出生
证明、监护证明，手持身份证明照片、银行卡、支
付账单及记录、支付人基本信息。
为证明是未成年人消费，需提供带有时间戳的视频
等能证明是未成年人非授权行为的证据用于业务审
核。
重要提示:根据法律规定，本产品禁止未满8周岁
以下未成年人购买。如您是8同岁以上、未满18周
岁的未成年人，请您务必在获得相关监护人的同意
后，才能使用本产品及相关服务。经确认为成年人
购买或已经获得监护人同意的。产品一经销售，请
恕我们无法因“未得到监护人允许擅自购买"“家里小
朋友末经允许抽盒的"、"盒子不好"、"抽到重复的”
等任何理由响应您的退货要求，您需自行承担相应
法律后果。`;
    case 8:
      return (
        "一、玩法概述\n" +
        "用户可以通过【集赏行动】将已购买且未发货的商品，按照对应数量门槛，兑换为玩法中可供集赏的好物商品。完成后，用于集赏的商品将替换为想要集赏的商品，发放至用户盒柜中，可前往盒柜操作商品发货。\n" +
        "二、如何进阶\n" +
        "1、在购买商品后，用户可前往【首页-集赏行动】，点击进入玩法页面，浏览并选择商品；\n" +
        "2、选中想要的好物商品后，页面将默认展示可用于集赏的商品；\n" +
        "3、点击选择已获得的商品，将按对应商品的助力值积累集赏进度，当进度达到100%时点击”立即集赏“即可将已选中的普通款商品，集赏对应的好物商品：好物商品同时包括实物商品与虚拟商品（虚拟商品可能附赠点券、抵扣券、包邮券等权益，具体以集赏页面显示为准），具体所需普通款商品个数以页面展示为准。\n" +
        "4、集赏完成后，用户可在玩法页面点击“记录”查看已完成的集赏记录；\n" +
        "5、当用户选中的商品，集赏进度超过100%时，页面将提示已达到进阶所需商品素材，不用继续增选更多的商品；\n" +
        "6、当进阶进度超过100%，且减少任一普通款进度将小于100%时，用户同样可以完成集赏，超出部分将以点券的形式进行补偿，请用户合理选择需要消耗的商品；\n" +
        "7、可供集赏的好物商品，库存有限，兑完即止，其中部分商品设置集赏次数限制，每个卡核账号每日只能集赏指定次数，次日零点刷新，具体限制规则详见对应玩法页面；\n" +
        "8、禁止使用外挂、脚本、同步器、按键宏、云手机多开、硬件辅助设备或其他软件程序等第三方辅助工具，若发现用户违规，将采取各种处理措施，包括但不限于：暂时禁止参与进阶兑换；取消进阶资格；永久封停账号；情节严重的，我司保留追究用户法律责任的权利。\n" +
        "三、发货与售后\n" +
        "1、在集赏对应商品后，无法撤回，现货商品将发放至用户盒柜中，用户可前往【盒柜-待处理】查看对应商品，并操作现货商品发货；\n" +
        "2、如用户集赏的好物商品为预售类型，将在【盒柜-待处理】中展示预计到货时间，达到货时间后可进行发货操作；\n" +
        "3、集赏所得商品支持与其他待发货商品合并发货，包邮门槛与卡核平台包邮政策一致；\n" +
        "4、已集赏的好物商品不支持七天无理由退款（含虚拟商品），其余规则详见《卡核集赏行动服务协议》、《卡核用户服务协议》。\n"
      );
    case 9:
      return (
        "一、玩法概述\n" +
        "用户可以通过【拼团】参与报名，可获得一张明信片以及“卡密”，销售完成后将会由商家开启直播，“卡密”与拆出的卡牌对应，则可获得该卡牌。\n" +
        "二、直播时间\n" +
        "一般为报名结束后24小时内会开卡，具体时间以商家群内公布为准。\n" +
        "三、获卡方式\n" +
        "直播后一个工作日内，会生成拆卡报告，同时获得的卡牌会放在盒柜中，填写地址选择发货后，将在3~7个工作日内寄出。\n" +
        "四、退款说明\n" +
        "销售若超过15天仍未报名满，则会发起退款，所有款项将通过系统原路退回，除此特殊情况外，均无法提供退款服务"
      );
    case 10:
      return (
        "活动介绍<br>" +
        "本活动是回馈顾客，每日达到消费门槛即可领取参与券(实体)，收到后可在本页面提交参与券上参与码参与免费抽选，当参与数量达到时会从提交的券码中抽取获得者，参与券越多则获得概率越高。参与券仅限参与本期，无法留到下期使用，请收到后及时参与，若过期则视为自愿弃权。<br>" +
        "<br>" +
        "<br>" +
        "参与券介绍<br>" +
        "1.本券可在指定小程序内免费参与抽选活动<br>" +
        "2.每期的奖品不同，请及时查看本期对应奖品<br>" +
        "3.每期的参与奖券只适合当期使用，过期未使用则视为放弃参与<br>" +
        "4.如出现参与码无效，请及时联系客服处理"
      );
    default:
      return "";
  }
};
